HovsepShahoyan/STM32F746G-DISCO-TFTP/stm32f746-tftp/Core/Src/main.c
uint8_t QSPI_ResetChip()
{
QSPI_CommandTypeDef sCommand;
uint32_t temp = 0;
/* Erasing Sequence -------------------------------------------------- */
sCommand.InstructionMode = QSPI_INSTRUCTION_1_LINE;
sCommand.AddressSize = QSPI_ADDRESS_24_BITS;
sCommand.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
sCommand.DdrMode = QSPI_DDR_MODE_DISABLE;
sCommand.DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY;
sCommand.SIOOMode = QSPI_SIOO_INST_EVERY_CMD;
sCommand.Instruction = RESET_ENABLE_CMD;
sCommand.AddressMode = QSPI_ADDRESS_NONE;
sCommand.Address = 0;
sCommand.DataMode = QSPI_DATA_NONE;
sCommand.DummyCycles = 0;

if (HAL_QSPI_Command(&hqspi, &sCommand, HAL_QPSI_TIMEOUT_DEFAULT_VALUE)
!= HAL_OK) {
return HAL_ERROR;
}
for (temp = 0; temp < 0x2f; temp++) {
__NOP();
}

sCommand.InstructionMode = QSPI_INSTRUCTION_1_LINE;
sCommand.AddressSize = QSPI_ADDRESS_24_BITS;
sCommand.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
sCommand.DdrMode = QSPI_DDR_MODE_DISABLE;
sCommand.DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY;
sCommand.SIOOMode = QSPI_SIOO_INST_EVERY_CMD;
sCommand.Instruction = RESET_MEMORY_CMD;
sCommand.AddressMode = QSPI_ADDRESS_NONE;
sCommand.Address = 0;
sCommand.DataMode = QSPI_DATA_NONE;
sCommand.DummyCycles = 0;

if (HAL_QSPI_Command(&hqspi, &sCommand, HAL_QPSI_TIMEOUT_DEFAULT_VALUE)
!= HAL_OK) {
return HAL_ERROR;
}
return HAL_OK;
}


uint8_t CSP_QSPI_Erase_Block(uint32_t BlockAddress)
{
QSPI_CommandTypeDef s_command;

/* Initialize the erase command */
s_command.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
s_command.Instruction       = SUBSECTOR_ERASE_CMD;
s_command.AddressMode       = QSPI_ADDRESS_1_LINE;
s_command.AddressSize       = QSPI_ADDRESS_24_BITS;
s_command.Address           = BlockAddress;
s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
s_command.DataMode          = QSPI_DATA_NONE;
s_command.DummyCycles       = 0;
s_command.DdrMode           = QSPI_DDR_MODE_DISABLE;
s_command.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
s_command.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

/* Enable write operations */
if (QSPI_WriteEnable() != HAL_OK)
{
return HAL_ERROR;
}

/* Send the command */
if (HAL_QSPI_Command(&hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
{
return HAL_ERROR;
}

/* Configure automatic polling mode to wait for end of erase */
if (QSPI_AutoPollingMemReady() != HAL_OK)
{
return HAL_ERROR;
}

return HAL_OK;
}


uint8_t CSP_QSPI_Write(uint8_t* pData, uint32_t WriteAddr, uint32_t Size)
{
QSPI_CommandTypeDef s_command;
uint32_t end_addr, current_size, current_addr;

/* Calculation of the size between the write address and the end of the page */
current_size = N25Q128A_PAGE_SIZE - (WriteAddr % N25Q128A_PAGE_SIZE);

/* Check if the size of the data is less than the remaining place in the page */
if (current_size > Size)
{
current_size = Size;
}

/* Initialize the adress variables */
current_addr = WriteAddr;
end_addr = WriteAddr + Size;

/* Initialize the program command */
s_command.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
s_command.Instruction       = EXT_QUAD_IN_FAST_PROG_CMD;
s_command.AddressMode       = QSPI_ADDRESS_4_LINES;
s_command.AddressSize       = QSPI_ADDRESS_24_BITS;
s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
s_command.DataMode          = QSPI_DATA_4_LINES;
s_command.DummyCycles       = 0;
s_command.DdrMode           = QSPI_DDR_MODE_DISABLE;
s_command.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
s_command.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

/* Perform the write page by page */
do
{
s_command.Address = current_addr;
s_command.NbData  = current_size;

/* Enable write operations */
if (QSPI_WriteEnable() != HAL_OK)
{
return HAL_ERROR;
}

/* Configure the command */
if (HAL_QSPI_Command(&hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
{
return HAL_ERROR;
}

/* Transmission of the data */
if (HAL_QSPI_Transmit(&hqspi, pData, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
{
return HAL_ERROR;
}

/* Configure automatic polling mode to wait for end of program */
if (QSPI_AutoPollingMemReady() != HAL_OK)
{
return HAL_ERROR;
}

/* Update the address and size variables for next page programming */
current_addr += current_size;
pData += current_size;
current_size = ((current_addr + N25Q128A_PAGE_SIZE) > end_addr) ? (end_addr - current_addr) : N25Q128A_PAGE_SIZE;
} while (current_addr < end_addr);

return HAL_OK;
}


uint8_t CSP_QSPI_Read(uint8_t* pData, uint32_t ReadAddr, uint32_t Size)
{
QSPI_CommandTypeDef s_command;

/* Initialize the read command */
s_command.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
s_command.Instruction       = QUAD_INOUT_FAST_READ_CMD;
s_command.AddressMode       = QSPI_ADDRESS_4_LINES;
s_command.AddressSize       = QSPI_ADDRESS_24_BITS;
s_command.Address           = ReadAddr;
s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
s_command.DataMode          = QSPI_DATA_4_LINES;
s_command.DummyCycles       = N25Q128A_DUMMY_CYCLES_READ_QUAD;
s_command.NbData            = Size;
s_command.DdrMode           = QSPI_DDR_MODE_DISABLE;
s_command.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
s_command.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

/* Configure the command */
if (HAL_QSPI_Command(&hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
{
return HAL_ERROR;
}

/* Set S# timing for Read command */
MODIFY_REG(hqspi.Instance->DCR, QUADSPI_DCR_CSHT, QSPI_CS_HIGH_TIME_3_CYCLE);

/* Reception of the data */
if (HAL_QSPI_Receive(&hqspi, pData, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
{
return HAL_ERROR;
}

/* Restore S# timing for nonRead commands */
MODIFY_REG(hqspi.Instance->DCR, QUADSPI_DCR_CSHT, QSPI_CS_HIGH_TIME_6_CYCLE);

return HAL_OK;
}



//void DumpHex(const void* data, size_t size) {
//	char ascii[17];
//	size_t i, j;
//	ascii[16] = '\0';
//	for (i = 0; i < size; ++i) {
//		printf("%02X ", ((char*)data)[i]);
//		if (((char*)data)[i] >= ' ' && ((unsigned char*)data)[i] <= '~') {
//			ascii[i % 16] = ((char*)data)[i];
//		} else {
//			ascii[i % 16] = '.';
//		}
//		if ((i+1) % 8 == 0 || i+1 == size) {
//			printf(" ");
//			if ((i+1) % 16 == 0) {
//				printf("|  %s "
//						"\n\r", ascii);
//			} else if (i+1 == size) {
//				ascii[(i+1) % 16] = '\0';
//				if ((i+1) % 16 <= 8) {
//					printf(" ");
//				}
//				for (j = (i+1) % 16; j < 16; ++j) {
//					printf("   ");
//				}
//				printf("|  %s \n\r", ascii);
//			}
//		}
//	}
//}

//void hexDump (
//    const char * desc,
//    const void * addr,
//    const int len,
//    int perLine
//) {
//    if (perLine < 4 || perLine > 64) perLine = 16;
//    int i;
//    unsigned char buff[perLine+1];
//    const unsigned char * pc = (const unsigned char *)addr;
//
//    for (i = 0; i < len; i++) {
//
//        if ((i % perLine) == 0) {
//            if (i != 0) printf ("  %s\n\r", buff);
//            printf ("  %04x ", i);
//        }
//        printf (" %02x", pc[i]);
//        if ((pc[i] < 0x20) || (pc[i] > 0x7e))
//            buff[i % perLine] = '.';
//        else
//            buff[i % perLine] = pc[i];
//        buff[(i % perLine) + 1] = '\0';
//    }
//    while ((i % perLine) != 0) {
//        printf ("   ");
//        i++;
//    }
//    printf ("  %s\n\r", buff);
//}

int _write(int fd, char * ptr, int len)
{
  HAL_UART_Transmit(&huart1, (uint8_t *) ptr, len, HAL_MAX_DELAY);
  return len;
}

static void * tftp_open_file(const char* fname, u8_t is_write)
{
  printf("%s \r\n",fname);
  if (is_write) {
    return (void*)fopen(fname, "wb");
  } else {
    return (void*)fopen(fname, "rb");
  }
}

void* aopen(const char* fname, const char* mode, u8_t write)
{
	printf("TFTP open \r\n");
	//uint8_t Test[] = "TFTP open\r\n"; //Data to send
	//HAL_UART_Transmit(&huart1,Test,sizeof(Test),10);// Sending in normal mode
	//LWIP_UNUSED_ARG(mode);
	//tftp_open_file(fname, write);
	return fp;
}

