HovsepShahoyan/STM32F746G-DISCO-TFTP/stm32f746-tftp/Core/Src/main.c
void aclose(void* handle) {
	printf("TFTP close \r\n");
	//uint8_t Test[] = "TFTP close\r\n"; //Data to send
	//HAL_UART_Transmit(&huart1,Test,sizeof(Test),10);// Sending in normal mode
}

int aread(void* handle, void* buf, int bytes) {
	printf("TFTP reads");
	//uint8_t Test[] = "TFTP read!!!\r\n"; //Data to send
	//HAL_UART_Transmit(&huart1,Test,sizeof(Test),10);// Sending in normal mode
	return 1;
}

int awrite(void* handle, struct pbuf* p) {
	printf("TFTP write  ");
	u8_t* temp = (u8_t*)p->payload;
	for(int i = 0; i < p->len; i++)
	{
		if(i == 0) {
			printf("00000000 ");
		}
		else if(i % 16 == 0) {
			printf("%08x", i);
		}
	    printf("%02x ", *(temp+i));
	}
	//DumpHex(&temp, p->len);
	printf("\r\n");
	return 1;
}
/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  /* init code for USB_HOST */
  MX_USB_HOST_Init();

  /* init code for LWIP */
  MX_LWIP_Init();
  /* USER CODE BEGIN 5 */
  tftp_init(&ctx1);
  /* Infinite loop */
  for(;;)
  {
    osMutexWait(myMutex01Handle, osWaitForever);
    //printf("p1>\n\r");
    for(int i = 0; i < 5; ++i) {
    	printf("%d \r\n", readbuf[i]);
    }
    fflush(stdin);

	osMutexRelease(myMutex01Handle);
	osDelay(1000);
  }
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_StartTask02 */
/**
* @brief Function implementing the myTask02 thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTask02 */
void StartTask02(void const * argument)
{
  /* USER CODE BEGIN StartTask02 */
  /* Infinite loop */
  for(;;)
  {
     osMutexWait(myMutex01Handle, osWaitForever);
     //printf("p2>\n\r");
     fflush(stdin);
	 osMutexRelease(myMutex01Handle);
	 osDelay(1000);
  }
  /* USER CODE END StartTask02 */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
